{
    "syllabi": [
        {
        "syllabus_year": "2015-2016",
        "program": [
          {
            "year": "First",
            "semester": "I",
            "courses": [
              {
                "id": "USCS101",
                "name": "Fundamentals of Computer Organization & Embedded Systems",
                "outcomes": [
                  "Apply knowledge of computer architecture and organization appropriate to the discipline.",
                  "Analyze given processing element, and identify and define the computing requirements.",
                  "Design, implement, and evaluate a microcontroller-based system, process, component, or program to meet desired needs.",
                  "Use current techniques, skills, and tools necessary for Low-Level computing."
                ]
              },
              {
                "id": "USCS102",
                "name": "Introduction to Programming using Python",
                "outcomes": [
                  "Students should be able to understand the concepts of programming before actually starting to write new programs.",
                  "Students should be able to understand what happens in the background when the programs are executed.",
                  "Students should be able to develop logic for Problem Solving.",
                  "Students should be made familiar with the basic constructs of programming such as data, operations, conditions, loops, functions, etc.",
                  "Students should be able to apply the problem-solving skills using syntactically simple language, i.e., Python (version: 3.X or higher)."
                ]
              }
            ]
          },
          {
            "year": "Second",
            "semester": "II",
            "courses": [
              {
                "id": "USCS201",
                "name": "Introduction to Database Management Systems",
                "outcomes": [
                  "Students should be able to evaluate business information problems and find the requirements of a problem in terms of data.",
                  "Students should be able to design the database schema with the use of appropriate data types for storage of data in a database.",
                  "Students should be able to create, manipulate, query, and back up the databases."
                ]
              },
              {
                "id": "USCS202",
                "name": "Advanced Programming using Python",
                "outcomes": [
                  "Students should be able to understand how to read/write to files using Python.",
                  "Students should be able to catch their own errors that happen during execution of programs.",
                  "Students should get an introduction to the concept of pattern matching.",
                  "Students should be familiar with the concepts of GUI controls and designing GUI applications.",
                  "Students should be able to connect to the database to move the data to/from the application.",
                  "Students should know how to search and sort data and how to determine the efficiency of algorithms used."
                ]
              }
            ]
          }
        ]
      }

    ]
}
  